// --створити масив з:
//     - з 5 числових значень
let int = [1, 2, 3, 4, 5];
// - з 5 стічкових значень
let str = ['a', 'b', 'c', 'd', 'q'];
// - з 5 значень стрічкового, числового та булевого типу
let all = [1, 2, 'fgs', 'lorem', true];

// - та вивести його в консоль
// console.log(int, str,all);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консол

// let empty = [];
// empty[0] = true;
// empty[1] = 'blue';
// empty[2] = 123;
// empty[3] = false;
// console.log(empty);

// - є масив [2,17,13,6,22,31,45,66,100,-18] :
let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// 1. перебрати його циклом while
//     let i = 0;
//     while (i < arr.length) {
//         console.log(arr[i]);
//         i++;
//     }
//     2. перебрати його циклом for
//     for (let i = 0; i < arr.length; i++) {
//         console.log(arr[i]);
//     }
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
//     let i = 0;
//     while (i < arr.length) {
//         if (i % 2 !== 0){
//             console.log(arr[i]);
//         }
//         i++;
//     }
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//     for (let i = 1; i<arr.length;i+=2){
//         console.log(arr[i]);
//     }
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//     let i = 0;
//     while (i < arr.length) {
//             if (arr[i] %2 ===0){
//                 console.log(arr[i]);
//             }
//         i++;
//     }
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//     for (let i = 0; i < arr.length; i++){
//         if (arr[i] % 2 === 0){
//             console.log(arr[i]);
//         }
//     }
// 7. замінити кожне число кратне 3 на слово "okten";
// for (let i =0;i<arr.length;i++){
//     if (arr[i] % 3 ===0){
//         arr[i] = 'okten';
//     }
// }
// console.log(arr);
// 8. вивести масив в зворотньому порядку.
// for (let i = arr.length - 1; i >= 0; i -= 1) {
//     console.log(arr[i]);
// }
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки
// булеві елементи
// all = [1,2,3,4,'fasf','fafs','fasfaf',true,false];
// for (let item of all) {
//     if (typeof item === "boolean"){
//         console.log(item);
//     }
// }
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки
// числові елементи
// all = [1,2,3,4,'fasf','fafs','fasfaf',true,false];
// for (let item of all) {
//     if (typeof item === "number"){
//         console.log(item);
//     }
// }
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки
// рядкові елементи
// all = [1,2,3,4,'fasf','fafs','fasfaf',true,false];
// for (let item of all) {
//     if (typeof item === "string"){
//         console.log(item);
//     }
// }
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
//     Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
let books = [
    {name: 'Haryk', numP: 235, author:  'bobyk', genre: 'drama'   },
    {name: 'Fight club', numP: 320, author:  'men', genre: 'horror'   },
    {name: 'American psyhos', numP: 123, author:  'flint', genre: 'comedy'   }
];
// -знайти наібльшу книжку.


// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор